saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Infineon.TLE986x_DFP.1.3.2.pdsc
		  <device Dname="TLE9867QXW20">
			<processor Dclock="24000000"/>
			<compile header="Device\Include\tle986x.h" define="TLE9867QXW20;RTE_DEVICE_BF_STEP"/>
			<debug      svd="SVD\TLE986x.svd"/>
			<memory     id="IROM1"                      start="0x11000000"  size="0xEFFC"     startup="1"   default="1"/>
			<memory     id="IROM2"                      start="0x1100EFFC"  size="4"          startup="0"   default="1"/>
			<memory     id="IRAM1"                      start="0x18000000"  size="0x1800"     init   ="0"   default="1"/>
			<algorithm  name="Flash\TLE9867.FLM"        start="0x11000000"  size="0x10000"                  default="1"/>
			<book    name="Documents\TLE986xQX-Users-Manual-13-Infineon.pdf"   title="TLE986x Series Reference Manual"/>
			<book    name="Documents\TLE986xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE986x BF-Step Series BootROM Manual"/>
			<book    name="Documents\TLE9867QXW20-BF-Data-Sheet-11-Infineon.pdf"  title="TLE9867QXW20 Data Sheet - BF-Step"/>
			<book    name="Documents\TLE986x-PACK-User-Manual-132-Infineon.pdf"  title="PACK User Manual"/>
			<feature type="ADC"           n="1"       m="10"/>
			<feature type="ADC"           n="1"       m="8"/>
			<feature type="IOs"           n="11"/>
		  </device>
		  <device Dname="TLE9869QXA20">
			<processor Dclock="24000000"/>
			<compile header="Device\Include\tle986x.h" define="TLE9869QXA20"/>
			<debug      svd="SVD\TLE986x.svd"/>
			<memory     id="IROM1"                      start="0x11000000"  size="0x1EFFC"     startup="1"   default="1"/>
			<memory     id="IROM2"                      start="0x1101EFFC"  size="4"           startup="0"   default="1"/>
			<memory     id="IRAM1"                      start="0x18000000"  size="0x1800"      init   ="0"   default="1"/>
			<algorithm  name="Flash\TLE9869.FLM"        start="0x11000000"  size="0x20000"                   default="1"/>
			<book    name="Documents\TLE986xQX-Users-Manual-13-Infineon.pdf"   title="TLE986x Series Reference Manual"/>
			<book    name="Documents\TLE986xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE986x BE-Step Series BootROM Manual"/>
			<book    name="Documents\TLE986xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE986x BF-Step Series BootROM Manual"/>
			<book    name="Documents\TLE9869QXA20-Data-Sheet-10-Infineon.pdf"  title="TLE9869QXA20 Data Sheet - BE-Step"/>
			<book    name="Documents\TLE9869QXA20-BF-Data-Sheet-10-Infineon.pdf"  title="TLE9869QXA20 Data Sheet - BF-Step"/>
			<book    name="Documents\TLE986x-PACK-User-Manual-132-Infineon.pdf"  title="PACK User Manual"/>
			<feature type="ADC"           n="1"       m="10"/>
			<feature type="ADC"           n="1"       m="8"/>
			<feature type="IOs"           n="11"/>
		  </device>
      </subFamily>
   </family>
  </devices>

  <conditions>                                                                
  <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="TLE986x CMSIS Device">                                     
    <!-- conditions selecting Devices -->
      <description>Infineon TLE986x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Cclass="Device" Cgroup="SDK" Csub="SCU"/>
      <require Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
      <require Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
      <require Cclass="Device" Cgroup="SDK" Csub="ISR"/>
      <require Cclass="Device" Cgroup="SDK" Csub="INT"/>
      <require Cclass="Device" Cgroup="SDK" Csub="PORT"/>
      <require Dvendor="Infineon:7" Dname="TLE986*QX*"/>
    </condition>

    <condition id="TLE986x">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE986x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE986*QX*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

	<condition id="TLE986xABF">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE986x device series, BF-Step</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE986*QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
	
    <condition id="TLE9861QXA20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9861QXA20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9861QXA20"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867QXA20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867QXA20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QXA20"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867QXA40">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867QXA40 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QXA40"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867QXW20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867QXW20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QXW20"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9869QXA20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9869QXA20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9869QXA20"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="TLE9861 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9861 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9861QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QX*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
