saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Infineon.TLE986x_DFP.1.3.2.pdsc
    <condition id="TLE9869 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9869 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9869QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
  </conditions>

    <boards>
     <board vendor="Infineon" name="TLE9869 EvalKit" revision="V1.0" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE9869 Eval. Kit Support and Examples</description>
      <image small="Images\TLE9869QX_EvalKit_v1.0_Top-view_small.png" large="Images\TLE9869QX_EvalKit_v1.0_Top-view.png"/>
      <book category="overview"  name="https://www.infineon.com/cms/en/product/evaluation-boards/TLE9869+EVALKIT/productType.html?productType=5546d46259b0420a0159d007327c08ae" title="TLE986x Eval.Board Web Page"/>
      <book category="setup"     name="Documents\TLE9869-EvalKit-User-Manual-Infineon.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents\TLE9869_EvalKit_V1.0.zip" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9869QXA20"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE986x Series"/>
  	    <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
	    <feature type="PWR"       n="5"              name="USB Powered"/>
	    <feature type="PWR"       n="12" m="5"      name="POWER Connector for external supply"/>
	    <feature type="DIO"       n="13"             name="Pins at pin headers"/>
	    <feature type="AIO"       n="3"              name="Analog inputs at AD"/>
	    <feature type="LED"       n="8"              name="User LEDs"/>
      <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
  </boards>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TLE986x CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Infineon TLE986x device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>
		
		<!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_tle986x.s" attr="config" condition="TLE9861 ARM" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_tle986x.s" attr="config" condition="TLE9867 ARM" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_tle986x.s" attr="config" condition="TLE9869 ARM" version="1.0"/>

		<!-- system file -->      
        <file category="source" name="Device\Source\system_tle986x.c" attr="config" condition="TLE9861 ARM" version="1.1"/>
        <file category="source" name="Device\Source\system_tle986x.c" attr="config" condition="TLE9867 ARM" version="1.1"/>
        <file category="source" name="Device\Source\system_tle986x.c" attr="config" condition="TLE9869 ARM" version="1.1"/>
        <file category="source" name="Device\Source\tle_device.c" attr="config" condition="TLE986x" version="0.1.0"/>
        <file category="header" name="Device\Include\system_tle986x.h" attr="config" condition="TLE986x" version="0.01"/>
        <file category="header" name="Device\Include\types.h" attr="config" condition="TLE986x" version="0.2.0"/>
        <file category="header" name="Device\Include\eval_board.h" attr="config" condition="TLE986x" version="0.2.0"/>

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\bsl_defines.h" attr="config" condition="TLE9861QXA20" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\bsl_defines.h" attr="config" condition="TLE9867QXA20" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\bsl_defines.h" attr="config" condition="TLE9867QXA40" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\bsl_defines.h" attr="config" condition="TLE9867QXW20" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\bsl_defines.h" attr="config" condition="TLE9869QXA20" version="1.8"/>   
		<file category="header"  name="Device\Include\tle986x.h" attr="config" condition="TLE986x" version="2.15"/>
		<file category="header"  name="Device\Include\tle_device.h" attr="config" condition="TLE986x" version="1.0.6"/>

        <file category="sourceC" name="Device\SDK\app\main.c" attr="template" select="Simple Main" condition="TLE986x" version="1.2.0"/> 		
     </files>
    </component>

	<!-- START: Infineon Standard Peripherals Low Level Drivers -->
    <component Cclass="Device" Cgroup="ConfigWizard" Cversion="1.8.6" condition="TLE986x">  <!-- Cversion is necessary -->
	 <description>Infineon ConfigWizard Configuration File</description>
	 <files>
        <file category="source" name="Device\SDK\cfgwiz\TLE9861QXA20\config.icwp" attr="config" condition="TLE9861QXA20" version="1.8.6"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9867QXA20\config.icwp" attr="config" condition="TLE9867QXA20" version="1.8.6"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9867QXA40\config.icwp" attr="config" condition="TLE9867QXA40" version="1.8.6"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9867QXA40\config.icwp" attr="config" condition="TLE9867QXW20" version="1.8.6"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9869QXA20\config.icwp" attr="config" condition="TLE9869QXA20" version="1.8.6"/>

        <file category="header" name="Device\SDK\cfgwiz\TLE9861QXA20\scu_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9867QXA20\scu_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9867QXA40\scu_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9867QXA40\scu_defines.h" attr="config" condition="TLE9867QXW20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9869QXA20\scu_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\common\pmu_defines.h" attr="config" condition="TLE986x" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\adc1_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\adc1_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\adc1_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\adc1_defines.h" attr="config" condition="TLE9867QXW20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\adc1_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.6"/>      

