saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Infineon.TLE986x_DFP.1.3.2.pdsc
        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\adc2_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\adc2_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\adc2_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\adc2_defines.h" attr="config" condition="TLE9867QXW20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\adc2_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\common\bdrv_defines.h" attr="config" condition="TLE986x" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\ccu6_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\ccu6_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\ccu6_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\ccu6_defines.h" attr="config" condition="TLE9867QXW20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\ccu6_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\common\csa_defines.h" attr="config" condition="TLE986x" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\gpt12e_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\gpt12e_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\gpt12e_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\gpt12e_defines.h" attr="config" condition="TLE9867QXW20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\gpt12e_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\common\int_defines.h" attr="config" condition="TLE986x" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\isr_defines.h" attr="config" condition="TLE986x" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\lin_defines.h" attr="config" condition="TLE986x" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\mon_defines.h" attr="config" condition="TLE986x" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\port_defines.h" attr="config" condition="TLE986x" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\ssc_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\ssc_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\ssc_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\ssc_defines.h" attr="config" condition="TLE9867QXW20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\ssc_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\timer2x_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\timer2x_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\timer2x_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\timer2x_defines.h" attr="config" condition="TLE9867QXW20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\timer2x_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\timer3_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\timer3_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\timer3_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\timer3_defines.h" attr="config" condition="TLE9867QXW20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\timer3_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\uart_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\uart_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\uart_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\uart_defines.h" attr="config" condition="TLE9867QXW20" version="1.8.6"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\uart_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.6"/>      

        <file category="header"  name="Device\SDK\cfgwiz\common\dma_defines.h" attr="config" condition="TLE986x" version="1.8.6"/>      
        <file category="doc" name="Device\SDK\cfgwiz\script\ICW_TLE986x.xml" attr="config" condition="TLE986x" version="1.3.1"/>      
     </files>
    </component>
  
    <component Cclass="Device" Cgroup="BF-Stepping" Cversion="0.0.1" condition="TLE986xABF">
      <description>Select if target device is BF-Stepping</description>
      <RTE_Components_h>
        #define RTE_DEVICE_BF_STEP
      </RTE_Components_h>
      <files>
        <file category="doc" name="Documents/bf_stepping.html"/>
      </files>	  
    </component>

